<template>
	<view class="page-settle-agreement">
		<cl-topbar title="平台专家入驻协议"></cl-topbar>
		<view class="content">
			<cl-text value="【前言】"></cl-text>
			<cl-text class="text" :value="'尊敬的心理咨询师、精神科医生、心理治疗师等（以下简称“专家”），欢迎入驻'+appName+'平台并使用我们提供的产品和服务。'"></cl-text>
			<cl-text class="text"
				value="在完成注册程序或以任何方式使用平台服务前，请您务必仔细阅读并透彻理解本协议，在确认充分理解后选择接受或不接受本服务协议；一旦您完成“同意协议并注册”或开始以其他方式使用525心理平台服务，即表明您已阅读并同意受本服务协议的约束。如您不同意本服务协议或其中任何条款约定，您应不再进行下一步或停止注册程序。">
			</cl-text>
			<cl-text class="text" :value="appName+'平台再次提示您审慎阅读、充分理解各条款内容，特别是限制或免除责任的相应条款。'"></cl-text>
			<cl-text bold class="three-title" value="一、说明和定义"></cl-text>
			<cl-text class="text" :value="'1.1 服务平台：'+appName+'平台（包括但不限于网站、微信公众号、手机Wap/App，以下简称“本平台”或“本公司”）。'">
			</cl-text>
			<cl-text class="text"
				value="1.2 专家：指同意并承诺遵守本协议规定，通过本平台向平台用户提供心理咨询解答服务的具有相应资质的心理咨询师、精神科医师、心理治疗师、催眠师、婚姻家庭指导师等专业人士。"></cl-text>
			<cl-text class="text" value="1.3 服务：指专家通过本平台向平台用户提供的心理辅导、心理咨询等服务。"></cl-text>
			<cl-text class="text" value="1.4 付费服务：指专家在服务平台开通的收取费用的服务，服务价格由专家自由定价，经本平台审核通过后生效。"></cl-text>
			<cl-text bold class="three-title" value="二、协议内容及生效"></cl-text>
			<cl-text class="text" value="2.1 本协议内容包括协议正文及所有服务平台已经发布的或将来可能发布的各类规则。所有规则为协议不可分割的一部分，与协议正文具有同等法律效力。">
			</cl-text>
			<cl-text class="text"
				value="2.2 专家在使用服务平台提供的各项服务的同时，承诺接受并遵守各项相关规则的规定。本平台有权根据需要不时地制定、修改本协议或各类规则。如本协议有任何变更，本平台将在网站上以公示形式，或通过邮件、微信等形式通知专家。如专家不同意相关变更，必须立即以书面通知的方式终止本协议。任何修订和新规则一经在服务平台公布即自动生效，成为本协议的一部分。登录或继续使用服务将表示专家接受经修订的协议。除另行明确声明外，任何使服务范围扩大或功能增强的新内容均受本协议约束。">
			</cl-text>
			<cl-text class="text"
				value="2.3 专家签署或在线接受本协议，并且完成本平台的审核通过后，即意味本协议生效。本协议不涉及专家与服务平台其它用户之间因网上交易而产生的法律关系及法律纠纷。"></cl-text>
			<cl-text class="text"
				value="2.4 本平台保留在任何时候对服务及其相关功能、应用软件变更、升级的权利。本平台进一步保留在服务中开发新的模块、功能和软件或其它语种服务的权利。上述所有新的模块、功能、软件服务的提供，除非本平台另有说明，否则仍适用本协议。服务随时可能因本平台的单方判断而被增加或修改，或因定期、不定期的维护而暂缓提供，专家将会得到相应的变更通知。专家在此同意本平台在任何情况下都无需向其或第三方在使用服务时对其在传输或联络中的迟延、不准确、错误或疏漏及因此而致使的损害负责。">
			</cl-text>
			<cl-text bold class="three-title" value="三、专家入驻资格审核"></cl-text>
			<cl-text class="text" value="3.1 专家欲使用本公司的服务平台，必须向本公司提交相关证明，拥有执业所在地法律要求的执业资格。"></cl-text>
			<cl-text class="text" value="（1）在中国大陆执业的服务专家：需持有国家二级心理咨询师、国家三级心理咨询师资质、心理治疗师、婚姻家庭咨询师等执业资格；"></cl-text>
			<cl-text class="text" value="（2）在港澳台地区及海外执业的专家：需持有当地法律认可的执业资格。"></cl-text>
			<cl-text class="text" value="3.2 专家入驻需要提供的资料："></cl-text>
			<cl-text class="text" value="（1）执业所在地法律要求的执业资格证(必须)"></cl-text>
			<cl-text class="text" value="（2）身份证明/正反面（必须）"></cl-text>
			<cl-text class="text" value="（3）手持身份证照（必须）"></cl-text>
			<cl-text class="text" value="（4）一些必须的证明（必须）"></cl-text>
			<cl-text class="text" value="专家本人必须承诺提供给本平台的资料真实、准确、有效、合法。若有违反，由此引发一切后果，将由专家本人独立承担。"></cl-text>
			<cl-text class="text" value="在通过本平台审核后，才可以以专家身份在平台提供符合规定的服务。"></cl-text>
			<cl-text class="text" value="3.3 本平台保留以下权利："></cl-text>
			<cl-text class="text" value="（1）取消对任何专家的审核认证；"></cl-text>
			<cl-text class="text" value="（2）修改审核认证流程；"></cl-text>
			<cl-text class="text" value="（3）增加或减少审核认证所需要提供的信息和证明。"></cl-text>
			<cl-text class="text"
				value="3.4 信息变更的通知：协议期内，上述信息（包括相关证明文件）的任何变更专家都应及时通知本平台，如上述信息变更后使得专家不再能够履行本协议，本平台有权立即终止或中止本协议。">
			</cl-text>
			<cl-text class="text"
				value="3.5 专家保证其向本平台提供的全部信息和证明文件真实、准确且不存在超过时效问题（即保证所有证明文件在整个合同履行期间都处于有效期内）。专家同意及时的通知本平台并及时在服务平台更新其信息。如因上述原因发生纠纷或被相关国家主管机关处罚，专家应当独立承担全部责任，如给本平台（包括其合作伙伴、代理人、职员等）造成损失的，专家同意赔偿其全部损失。">
			</cl-text>
			<cl-text class="text"
				value="3.6 专家应对自己的账户和密码的安全负责。除非有法律规定或司法裁定，且征得本平台的同意，否则，账户不得以任何方式转让、赠与或继承。如果发现任何人不当使用专家账户或有任何其他可能危及专家账户安全的情形时，专家应当立即以有效方式通知本平台，要求本平台暂停相关服务。">
			</cl-text>
			<cl-text bold class="three-title" value="四、专家的权利和义务"></cl-text>
			<cl-text class="text"
				value="4.1 应符合专家的申请条件，且向本平台提供真实、合法、准确、有效的注册资料，并保证其诸如电子邮件地址、联系电话、联系地址、邮政编码等内容的有效性及安全性，保证本平台可以通过上述联系方式与自己进行联系。同时，专家也有义务在相关资料实际变更时及时更新有关注册资料。专家保证不以他人资料在服务平台进行注册。">
			</cl-text>
			<cl-text class="text" value="4.2 专家上传服务平台的内容以及在咨询中的言行需遵守国家法律、法规等规范性文件及本平台的各项规则和要求，遵守专业伦理及职业操守，不违背社会公共利益或公共道德，不损害他人的合法权益，不违反本协议及相关规则。如果因此产生任何法律后果的，专家应以自己的名义独立承担法律责任。"></cl-text>
			<cl-text class="text" value="4.3 专家不得开展任何形式的不正当竞争（包括但不限于以虚构或歪曲事实的方式不当评价其他本平台上的专家、采取不正当方式制造或提高自身的评价度及信用度、采取不正当方式制造或提高（降低）其他本平台上的专家的评价度及信用度等）。本公司有权对专家违反本条规范的行为进行指正、警告、中止或终止其专有账户的使用。"></cl-text>
			<cl-text class="text" value="4.4 专家在本平台上的工作不得影响专家在所属单位或者机构中的本职工作。专家因此与专家所属单位或者机构产生的纠纷，由专家自行承担，本公司不负任何法律责任。"></cl-text>
			<cl-text class="text" value="4.5 专家应就其在谈判、签署和履行本协议过程中所知悉或获取的本平台的有关信息和资料予以保密。未经本平台书面同意，专家不得向第三方披露该等信息。该保密义务不因本协议的任何可能的无效、解除或终止而无效、解除或终止。如本协议宣布无效、解除或终止，双方应继续持续履行相关的保密义务。"></cl-text>
			<cl-text class="text" value="4.6 在本平台注册的专家在通过平台进行服务时不得发出带有个人电话、QQ账号、微信账户、其他类似即时通讯工具账户、电子邮箱以及真实地址等联系方式的内容，若由此出现被扰或其他伤害情况，相关责任由专家自行承担。"></cl-text>
			<cl-text bold class="three-title" value="五、本公司的权利和义务"></cl-text>
			<cl-text class="text" value="5.1 本公司有义务在现有技术上维护整个服务平台的正常运行，并及时解决专家在使用过程中遇到的问题。"></cl-text>
			<cl-text class="text" value="5.1 本公司有义务在现有技术上维护整个服务平台的正常运行，并及时解决专家在使用过程中遇到的问题。"></cl-text>
			<cl-text class="text" value="5.2 如发生下列情况，本公司有权根据不同情况选择删除相关信息或停止对该专家提供服务平台，并追究相关法律责任："></cl-text>
			<cl-text class="text" value="（1）第三方通知本平台或本平台认为某个具体专家或具体服务事项可能存在问题；"></cl-text>
			<cl-text class="text" value="（2）专家或第三方向本平台告知服务平台上有违法或不当行为的，本公司以普通非专业人员的知识水平标准对相关内容进行判别，可以认为这些内容或行为具有违法可能或不当性质的，本公司有权根据不同情况选择删除相关信息和中止或终止相关专家专有账户的使用，并追究相关法律责任。"></cl-text>
			<cl-text class="text" value="（3）本平台或第三方发现某个具体专家拥有和本平台所营业务存在竞品关系的机构身份时，本平台有权根据不同情况选择删除相关信息或停止对该专家提供服务平台。"></cl-text>
			<cl-text class="text" value="5.3 本公司有权对专家的身份信息及服务行为进行审核，发现或有合理理由怀疑身份信息或服务行为中存在任何问题或怀疑，均有权向专家发出询问或要求改正的通知，中止或终止相关专家专有账户的使用。"></cl-text>
			
			<cl-text class="text" value="5.4 经国家生效法律文书或行政处罚决定确认专家存在违法行为，或者本平台有足够事实依据可以认定专家存在违法或违反协议行为的，本平台有权在服务平台公布专家的违法违规行为。"></cl-text>
			<cl-text class="text" value="5.5 本公司有权根据服务平台上用户对专家回答问题质量的评价以及其他专业、学术指标将专家与其他本平台注册的专家进行排名。专家明确并同意，相关排名并不代表本平台对于专家专业能力的评价。"></cl-text>
			<cl-text class="text" value="5.6 专家需向使用服务的平台用户明确：通过本平台提供的所有心理咨询辅导信息、图文信息、语音信息等皆不作为诊断结果和医疗的证据，用户只能作为参考。本公司与专家均不承担用户使用该等服务可能产生的医疗风险和责任。"></cl-text>
			<cl-text class="text" value="5.7 本公司有义务保护专家的保密资料及隐私信息（需要公布在平台中的资料和信息除外）的安全，不得泄露专家的隐私，但根据法律、法规要求及本协议约定予以公告的除外。"></cl-text>
			<cl-text class="text" value="5.8 本公司有权根据业务调整情况将本协议项下的全部权利义务一并转让给本公司关联公司，此种情况将会提前30天以平台公告的形式通知专家。专家承诺对此不持有异议。"></cl-text>
			<cl-text class="text" value="5.9 本公司对服务平台上注册的专家所发布的内容进行监督，发现不符合上述规定的内容，本公司有权利给予屏蔽或删除，并保留对不符合规定言论进行处理而不通知发布者的权利。"></cl-text>
			<cl-text bold class="three-title" value="六、用户服务基本原则"></cl-text>
			<cl-text class="text" value="专家通过本平台向平台用户提供服务或者付费服务过程中，应始终严格地遵守基本原则，具体内容如下："></cl-text>
			<cl-text class="text" value="6.1 专家有责任向用户说明心理咨询工作者的保密原则，以及应用这一原则的限度；"></cl-text>
			<cl-text class="text" value="6.2 心理咨询工作中的有关资料，包括个案记录、测验资料、信件、录音、录像和其他资料，均属专业信息，应在用户允许、严格保密的情况下进行保存，不得列入其他资料之中；"></cl-text>
			<cl-text class="text" value="6.3 专家只有在用户同意的情况下才能对咨询过程进行录音、录像。在因专业需要进行案例讨论时，应隐去那些可能据以辩认出用户的有关信息；"></cl-text>
			<cl-text class="text" value="6.4 在心理咨询过程中，一旦发现用户有危害自身和他人的情况，必须采取必要的措施，防止意外事件发生（必要时应通知有关部门或家属），或与其他专家进行磋商，但应将有关保密信息的暴露程度限制在最低范围之内；"></cl-text>
			<cl-text class="text" value="6.5 当专家在接受卫生、司法或公安机关询问时，不得做虚伪的陈述或报告，由此引发的法律责任，本公司不负任何责任。"></cl-text>
			<cl-text bold class="three-title" value="七、知识产权"></cl-text>
			<cl-text class="text" value="7.1 专家在本平台上发表或是在咨询过程中形成所有的文章、心得、体会等文字材料以及录像、访谈视频材料（以下简称“衍生材料”）的著作权均由专家所有。但专家不可撤销的授权许可本平台在中国大陆范围内，享有所有衍生材料的全部著作财产权（包括复制权、发行权、出租权、展览权、表演权、放映权、广播权、信息网络传播权、摄制权、改编权、翻译权及汇编权）。"></cl-text>
			<cl-text class="text" value="7.2 问答咨询信息及权利：由于本网站心理咨询的特性，专家无权删除解答记录，问答咨询信息在本网站支持提问者直接删除，届时该提问记录的所有相关解答内容也将一并删除。"></cl-text>
			<cl-text class="text" value="7.3 专家明确并同意："></cl-text>
			<cl-text class="text" value="（1）本协议项下的著作权许可使用为排他性专有使用；"></cl-text>
			<cl-text class="text" value="（2）本协议项下的著作权许可使用的期限为【十年】，自本协议生效之日起计算，且本协议项下的著作权许可使用不随本协议的终止、失效、解除而失效。"></cl-text>
			<cl-text class="text" value="（3）本协议项下的著作权许可使用为免费授权，本平台无需为取得或保有相关授权许可而向专家支付任何费用。"></cl-text>
			
			<cl-text class="text" value="（4）非经本平台事先书面许可，专家不得向任何第三方转让任何著作权利，且本平台享有在相同条件下优先受偿的权利。"></cl-text>
			<cl-text bold class="three-title" value="八、结算方式"></cl-text>
			<cl-text class="text" value="8.1 专家明确并同意，本平台有权代其收取平台用户支付的服务费，并有权自服务费中直接扣取应由本平台收取的相应居间费用。"></cl-text>
			<cl-text class="text" value="8.2 专家应按照法律规定自行缴纳相应税费。"></cl-text>
			<cl-text bold class="three-title" value="九、协议的终止"></cl-text>
			
			<cl-text class="text" value="9.1 通知解除：协议任何一方均可以提前15天通知终止本协议。"></cl-text>
			<cl-text class="text" value="9.2 本公司单方解除权："></cl-text>
			<cl-text class="text" value="（1）违反本公司的任何规则或本协议中的任何承诺或保证，包括但不限于本协议项下的任何约定，本公司都有权立刻终止本协议，且按有关规则要求专家进行赔偿；"></cl-text>
			<cl-text class="text" value="（2）若专家屡次违反本协议或相关规定，经本公司提醒仍不改正的；或因专家的言行对本公司造成损失的，本公司有权终止与专家的协议，并或终止相关专家专有账户的使用。"></cl-text>
			<cl-text class="text" value="（3）专家连续终止使用后一年或专家通过电子邮件形式告知本公司，本协议将自动终止。在协议终止前、账号注销前，专家均可随时自行再次开通使用。"></cl-text>
			
			<cl-text class="text" value="（4）专家咨询质量低下，低于网站规定的好评率，本平台有权立刻终止本协议。"></cl-text>
			<cl-text class="text" value="（5）专家有以下任意一条行为的，本平台有权立刻终止本协议，封号并由专家承担相应的法律责任：个人注册资料造假；作弊刷数据；违反咨询师职业道德规范；其他性质恶劣的损害别人利益的行为；"></cl-text>
			<cl-text class="text" value="9.3 本协议规定的其他协议终止条件发生或实现导致本协议终止的，本协议终止。"></cl-text>
			<cl-text class="text" value="9.4 协议终止后有关事项的处理："></cl-text>
			<cl-text class="text" value="（1）协议终止后，本平台没有义务为专家保留咨询账户中或与之相关的任何信息，或转发任何未曾阅读或发送的信息给专家或第三方。亦不就终止协议而对专家或任何第三者承担任何责任；"></cl-text>
			<cl-text class="text" value="（2）无论本协议因何原因终止，在协议终止前的行为所导致的任何赔偿和责任，专家必须完全且独立地承担；"></cl-text>
			<cl-text class="text" value="（3）协议终止后，本平台有权保留该专家的注册数据及以前的服务行为记录。如专家在协议终止前在服务平台上存在违法行为或违反协议的行为，本平台仍可行使本协议所规定的权利。"></cl-text>
			<cl-text bold class="three-title" value="十、协议期限"></cl-text>
			<cl-text class="text" value="本协议经专家在线接受且经过本平台认证通过后即告生效，除非本协议规定的终止条件发生，本协议将持续有效。双方另有约定的除外。"></cl-text>
			<cl-text bold class="three-title" value="十一、保密条款"></cl-text>
			<cl-text class="text" value="11.1 本协议所称商业秘密包括但不限于本协议、任何补充协议所述内容及在合作过程中涉及的其他产生商业利益的信息。任何一方未经商业秘密提供方同意，均不得将该信息向任何第三方披露、传播、编辑或展示。本协议终止后保密双方仍承担此条款下的保密义务。"></cl-text>
			<cl-text class="text" value="11.2 因对方书面同意以及国家、行政、司法强制行为而披露商业秘密的，披露方不承担责任；该商业秘密已为公众所知悉的，披露方不承担责任。"></cl-text>
			<cl-text bold class="three-title" value="十二、免责条款"></cl-text>
			<cl-text class="text" value="12.1 不论在何种情况下，本平台均不对由于Internet连接故障，电脑，通讯或其他系统的故障，电力故障，罢工，劳动争议，暴乱，起义，骚乱，生产力或生产资料不足，火灾，洪水，风暴，爆炸，不可抗力，战争，政府行为，国际、国内法院的命令或第三方的不作为而造成的不能服务或延迟服务承担责任。"></cl-text>
			<cl-text class="text" value="12.2 您明确并同意，本公司不对以下原因造成的任何损害（包括但不限于利润损失，服务中断，资料灭失及后续赔偿费用）承担任何形式的责任："></cl-text>
			<cl-text class="text" value="（1）未经授权的存取或修改数据或数据的传输。"></cl-text>
			<cl-text class="text" value="（2）平台用户及其他第三方通过平台所作的陈述或行为。"></cl-text>
			<cl-text bold class="three-title" value="十三、违约责任"></cl-text>
			<cl-text class="text" value="13.1 专家同意赔偿由于违反本协议而给本平台造成的任何损失（包括由此产生的全额的诉讼费用和律师费）。专家同意本平台不对任何其张贴的资料，包括诽谤性的，攻击性的或非法的资料，承担任何责任；由于此类材料对其它用户造成的损失由专家自行全部承担。"></cl-text>
			<cl-text class="text" value="13.2 专家承诺不得因任何原因、以任何方式（包括但不限于洽谈、教唆、强迫、威胁等）："></cl-text>
			<cl-text class="text" value="（1）与咨询用户达成任何以心理咨询师向咨询用户提供心理咨询相关服务为内容的线下咨询合意；"></cl-text>
			<cl-text class="text" value="（2）要求或是接受咨询用户将相应服务费用通过线下方式（包括但不限于现金交易、线下移动终端转账等）向其进行划转、支付。若心理咨询师违反本条款之约定，本公司有权冻结账户相关款项，封禁账户相关服务业务功能，并根据平台《用户服务协议》的约定要求心理咨询师承担一切后续责任。"></cl-text>
			<cl-text class="text" value="13.3 除本协议及服务平台规则另有约定之外，如一方发生违约行为，守约方可以书面通知方式要求违约方在指定的时限内停止违约行为，并就违约行为造成的损失进行索赔，如违约方未能按时停止违约行为，则守约方有权立即终止本协议。"></cl-text>
			<cl-text bold class="three-title" value="十四、争议解决及其他"></cl-text>
			<cl-text class="text" value="14.1 本协议之解释与适用，以及与本协议有关的争议，均应依照中华人民共和国法律予以处理。"></cl-text>
			<cl-text class="text" value="14.2 任何因本协议或在本协议履行过程中产生的争议，双方均应通过友好协商解决。若无法通过协商解决，任何乙方均有权将争议提交本公司住所地有管辖权的法院诉讼解决。"></cl-text>
			<cl-text class="text" value="14.3 如本协议的任何条款被视作无效或无法执行，则上述条款可被分离，其余部份则仍具有法律效力。"></cl-text>
			<cl-text class="text" value="14.4 本公司于专家过失或违约时放弃本协议规定的权利的，不得视为其对专家的其他或以后同类之过失或违约行为弃权。"></cl-text>
			<!-- <cl-text class="text" value="14.5 本协议最终归属权、解释权归珠海五二五科技有限公司所有。"></cl-text> -->
		</view>
	</view>
</template>

<script>
	import {
		allCfg
	} from '@/components/comm/allCfg'
	export default {
		data() {
			return {
				appName: allCfg.const.appName
			}
		},
		created() {

		}
	}
</script>

<style lang="scss" scoped>
	@import "@/my/article.scss";
</style>
