

export const yingzi: { [key: string]: string } = {
	'躯体化': '显示来访者主要感受到自己身体的不适感，例如伴随存在心血管、肠胃道、呼吸道系统主诉不适和头痛、脊痛、肌肉酸痛、以及焦虑的其他躯体表现。建议平时多一些对于躯体表现的关注，如果感觉已经影响正常的生活，并及时寻求专业帮助与指导干预。',
	'强迫': '显示来访者主要存在明知没有必要，但又无法摆脱的无意义的思想、冲动、行为等表现，还有一些比较一般的感知障碍(例如脑子变空了，“记忆力不行”等也会在这一因子中反映。建议平时多一些对于这一方面的关注，如果感觉已经影响正常的生活，并及时寻求专业帮助与指导干预。',
	'焦虑': '焦虑包括一些通常临床上明显与焦虑症状相联系的状与体验。一般指那些无法静息、神经过敏、紧张、以及由此产生躯体征象(如)。那种游离不定的及惊恐发作是本因子的主要内容，它还包括有一个反映“解体”的项目。高分显示来访者或许存在这一方面的问题，建议平时多一些对于这方面的关注，如果感觉已经影响正常的生活，并及时寻求专业帮助与指导干预。',
	'敌对性': '根据答题情况来看，来访者或许存在敌对表现、思想、感情及行为。包括从厌烦、争论、摔物、直至争斗和不可抑制的冲动暴发等各个方面。建议平时多一些对于这方面的关注，如果感觉已经影响正常的生活，并及时寻求专业帮助与指导干预。',
	'恐怖': '显示来访者或许存在对包括出门旅行，空旷场地、人群、或公共场合、交通工具以及社交的恐怖症状。建议平时多一些对于这方面的关注，如果感觉已经影响正常的生活，并及时寻求专业蒂助与指导干预。',
	'偏执': '偏执是一个十分复杂的概念，本因子只是包括了它的一些某本内容。根据答题情况来看，来访者或许存在思维方面，如投射性思维，敌对、猜疑、关系妄想、忘想、被动体验和夸大等虚状。建议平时多一些对于这方面的关注，如果感觉已经影响正常的生活，并及时寻求专业帮助与指导干预',
	'精神病性': '显示来访者或许存在幻想、思维播散、被控制感、思维被插入等反关替神分裂症的症状。建议平时多一些对于这方面的关注，如果感觉已经影响正常的生活，并及时寻求专业带助与指导干预',
	'其他': '显示来访者或许存在睡眠及饮食情况的困扰，建议平时多一些对于这方面的关注，如果感觉已经影响正常的生活，请及时寻求专业帮助与指导干预。',
}
export const adviceBigSCl = [
	{ title: '因子分分值的意义', text: '1-2提示心理健康\n2-3提示亚健康心理状态\n3-4提示有心理健康问题\n4-5提示有严重心理健康间题' },
	{ title: '', text: '下面是10个因子的定义:' },
	{ title: '躯体化', text: '该因子主要反映主观的身体不适感，包括心血管、肠胃道、呼吸道系统主诉不适和头痛、脊痛、肌肉酸痛、以及焦虑的其他躯体表现，' },
	{ title: '强迫', text: '该因子主要指那种明知没有必要，但又无法摆脱的无意义的思想、冲动、行为等表现，还有一些比较一般的感知障碍(如脑子变空了，“记忆力不行”等也在这一因子中反映。' },
	{ title: '人际关系', text: ' 该因子主要是反映某些个人不自在与自半路，尤其是在与其他人相比较时更为突出自卑感、懊丧、以及在人事关系明显相处不好的人，往往这一因于得高分。' },
	{ title: '抑郁', text: '反映的是临床上忧都状群相联系的广泛的念。忧都苦闷的感情和心境是代表性状，它还以对生活的兴趣减退，缺乏活动的愿望、丧失活动力等为特征，并包括失望、悲叹、与忧郁相联系的其它感知及躯体方面的问题。' },
	{ title: '焦虑', text: '包括一些通常临床上明与焦电状相耿索的状与体验、一般指那些无法静息、神经过敏、紫张、以及由此产生躯体征象(如额)。那种游离不定的焦虑及惊恐发作是本田子的主要内容，它还包括有一个反映“解体”的项目。' },

	{ title: '敌对性', text: '主要以三方面来反映前人的敌对表现、思想、感情及行为。包括从厌烦、争论、摔物、直至争斗和不可抑制的冲动暴发等各个方面。' },
	{ title: '恐怖', text: '与传统的恐怖状态所反映的内容基本一致，恐惧的对象包括出门旅行，空旷场地、人群、或公共场合及交通工具。此外还有反映社交恐怖的项目。' },
	{ title: '偏执', text: '偏执是一个十分复杂的概念，本因子只是包括了它的一些基本内容，主要是指思维方面，如投射性思维，敌对、猜疑、关系妄想、忘想、被动体验和夸大等。' },
	{ title: '精神病性', text: '其中有幻想、思维播散、被控制路、思维被插入等反映精神分裂症择定状项目。' },
	{ title: '其他', text: '该因子是反映眠及饮食情况的。' },
	{ title: '综合分析', text: '' }
]
export const topicTimes: { [key: string]: number } = {
	"躯体化": 12,
	"焦虑": 10,
	"强迫": 10,
	"抑郁": 13,
	"人际关系": 9,
	"精神病性": 10,
	"偏执": 6,
	"敌对性": 6,
	"恐怖": 7,
	"其他": 7
}
export const GADAdvice = {
	'正常': {
		shouDo: `从测验的结果来看，被测者的焦虑水平在正常范围内，属于正常情绪反应。希望被测者能继续保持这样的心理状态,同时做好以下几点预防焦虑情绪：
（1）培养广泛的兴趣、积极参加体育运动，保持轻松、愉快的心境。一张一弛的生活节奏可以有效的降低焦虑程度，缓解精神紧张。因此被测者应发展广泛的爱好，养成运动的习惯。这样即使在外界压力较大的情况下也可以防止焦虑情绪的积累。
（2）培养良好的学习和工作习惯。现在社会，节奏紧张，外界压力增加是每个人不可回避的问题。如果个人注意养成高效的工作和学习习惯，就可以有效减少工作、学习带来的压力感，提高应对压力的信心。`,
		advice: `被测者的测验得分处于正常范围内，属于正常情绪反应。说明被测者在过去一段时间里可能较少出现或基本上未出现以下焦虑症状：莫名感到紧张、焦虑；没有具体原因的惊恐和总觉得即将发生不幸的担忧；无法静坐等。被测者可能也会存在一定程度上焦虑感觉，不过处于正常水平状态。总体而言，适度的焦虑是有益的，往往能在一定程度上激发和提高人们学习和工作的效率。`
	},
	'轻度焦虑': {
		shouDo: `（1）营养充足、积极参加体育运动。充足的营养和一张一弛的生活节奏可以有效的降低焦虑程度，缓解精神紧张。因此被测者应调节饮食，养成运动的习惯。这样即使在外界压力较大的情况下也可以防止焦虑情绪的积累。
（2）睡眠充足，劳逸结合。即使有很重的学习或工作压力，也要尽量保证充足的睡眠。睡眠质量不好，也不好太过担心。而要以平常心对待，顺其自然。另外，在学习或工作之余，可以进行其它活动加以调节，如听轻音乐等有助于缓解紧张情绪。
（3）培养良好的学习和工作习惯。现在社会，节奏紧张，外界压力增加是每个人不可回避的问题。如果个人注意养成高效的工作和学习习惯，就可以有效减少工作、学习带来的压力感，提高应对压力的信心。`,
		advice: `被测者结果略高于正常范围，属于轻度焦虑水平。说明被测者在过去一段时间里可能偶尔觉察到自身的一些焦虑症状：莫名的紧张不安，不能放松，坐立不安；来回走动，搓手顿足；面部紧绷及眉头锁紧，自主神经活动增强。焦虑的内容完全取决于日常生活重点变动，没有中心主题，可能被测者自己也不清楚到底害怕什么。`
	},
	'中度焦虑': {
		shouDo: `从测验的结果来看，被测者的焦虑程度已超过正常值，存在比较高水平的焦虑症状。被测者的这一状况，应引起被测者足够的重视。被测者可能会明显的感到不适，工作、学习效率下降，睡。建议被测者向医院或者心理服务机构寻求帮助，通过心理咨询和心理治疗可以较快的缓解被测者的焦虑程度、提高应对压力情境、处理焦虑情绪的能力。如果被测者受到条件所限无法接受心理专业人员的帮助，也要学习一些调节焦虑情绪的方法，尽快的降低焦虑水平。
 （1）针对焦虑的生理症状(如肌肉紧张)采取渐进性肌肉放松法。通过全身肌肉收缩——放松的反复交替训练（吸气时保持肌肉紧张5~10秒，吐气时快速放松肌肉，体验放松感30秒），使人体验到紧张和放松的不同感觉，从而更好地认识紧张反应，最后达到心身放松的目的，并能够对身体各个器官的功能起到调整作用，阻止焦虑反应的恶性循环。有研究证实，放松训练的方法可有效地减轻GAD患者的症状。 
 （2）针对易烦躁情绪，注意培养良好的人际关系。少独处，多和身边家人、朋友倾诉，是拥有健康心态的一个积极策略。在烦躁忧郁、焦虑不安时，多走走、多看看、多玩玩、多活动，同时和自己亲近的人、要好的朋友倾吐内心的忧虑和苦闷，一方面可以宣泄自己的不良情绪，减轻心理压力；另一方面获得他人的陪伴、开导、指点，使个体感受到良好社会支持，利于调整自我心理状态。 
 （3）对焦虑的行为成分如回避、谨慎、兴奋和烦躁，采用担忧行为阻止法、时间管理和问题解决的方法。关于行为阻止法、时间管理和问题解决等方法需要有专业人员帮助下建立。`,
		advice: `被测者的测验得分略高于正常范围，属于中等广泛性焦虑反应。这个结果说明被测者在过去一段时间里可能较多的觉察到以下一些焦虑症状：莫名的紧张焦虑、没有原因的惊恐和可能不幸的预感。例如，对多种事件或活动呈现出的过分焦虑及担忧，思想难以集中或脑子一下子变空白，小动作增多、不能静坐，易疲劳，乏力。其人际交往、工作学习、睡眠等社会功能明显受影响。`
	},
	'严重焦虑': {
		shouDo: `从测验的结果来看，被测者的焦虑程度已明显超过正常水平值，存在严重程度的焦虑症状。被测者的这一状况，应引起被测者和家人的重视。建议被测者及早前往专业医疗机构进行明确诊断，以免延误治疗。严重的焦虑是一种情绪障碍，一般需要药物治疗以缓解躯体性的焦虑症状，同时辅以心理治疗，单纯的心理辅导往往已经很难直接起效。在被测者的焦虑水平处于较低水平的时候可以采用以下办法来逐渐增强自身抵御焦虑情绪的能力。
（1）深呼吸和放松技术：通过深呼吸和放松技术，可以减轻这些不适反应。正确的呼吸方式要点是：保持一种缓慢均匀的呼吸频率，将空气深呼吸入全肺，然后缓慢地全部呼出来。注意，吸气时让你的胃部鼓起来，这表示你已用全肺呼吸。放松技术主要采用肌肉放松法，通过全身肌肉收缩——放松的反复交替训练（吸气时保持肌肉紧张5~10秒，吐气时快速放松肌肉，体验放松感30秒），使人体验到紧张和放松的不同感觉，从而更好地认识紧张反应，最后达到心身放松的目的，并能够对身体各个器官的功能起到调整作用。
（2）培养良好的人际关系。少独处，多和身边家人、朋友倾诉，是拥有健康心态的一个积极策略。在烦躁忧郁、焦虑不安时，多走走、多看看、多玩玩、多活动，同时和自己亲近的人、要好的朋友倾吐内心的忧虑和苦闷，一方面可以宣泄自己的不良情绪，减轻心理压力；另一方面获得他人的陪伴、开导、指点，使个体感受到良好社会支持，利于调整自我心理状态。`,
		advice: `被测者存在严重的广泛性焦虑症状。这个结果说明被测者在过去一段时间里可能经常或持续感到易激惹、易疲劳、机体紧张警觉；过分的难以控制的担忧、无明确对象或固定内容的恐惧或惊恐；入睡困难，易惊醒、多梦等睡眠障碍；同时常常伴有自主神经症状或运动性不安（战栗、发抖，肌肉紧张甚至僵硬）。焦虑、恐惧和躯体症状的出现给被测者带来严重痛苦，并且严重影响其人际交往、工作学习、睡眠等社会功能。`
	}
}