export default {
	'汉语沟通发展量表（短表）': [
		{ min: 1, max: 5, tip: '甲:请指出哪些是您孩子可以听懂的句子(有适当的反应)。' },
		{ min: 6, max: 10, tip: '乙、当婴儿刚开始学习沟通的时候，他们经常用手势去表达他们的思想和愿望。请选出以下哪些项目可以是您孩子平时所作的动作。' },
		{ min: 11, max: 116, tip: '丙、词汇量表。当您说出该词时，孩子虽然还不能说出来，但能正确的反映，请填（听懂）。若孩子又能听懂又能够自己说出该字，请填（能说）。假如您的孩子对该字的发音不准（例如火车说成火些）或他的说法有所不同（例一：葡萄说：“萄”，例二：老鼠说成“耗子”），请填（能说）' },
	],
	'汉语沟通发展量表（短表）_词汇及句子': [
		{ min: 1, max: 112, tip: '甲:词汇,选择您孩子是否会说对应词语' },
		{ min: 112, max: 114, tip: '乙：句子与语句（注:“有时”即指孩子用过一次以上，“经常”即指需要用的时候大部分用到)' }
	]
}